In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('jobs_python.csv')
df.head()

,Job Title,Salary,Location
0,Data Scientist,"5.5K - 11,000 monthly",Kuala Lumpur
1,Azure Data Engineer,NaN,Kuala Lumpur
2,System Support Engineer (Software Developer),"5K - 8,000 monthly",Kuala Lumpur
3,Software Engineer,NaN,Kuala Lumpur
4,Web Developer (Python),"6K - 8,000 monthly",Kuala Lumpur

In [3]:
df.isnull().sum()

Job Title       0
Salary       8417
Location        0
dtype: int64

In [4]:
df.dropna(inplace=True)

In [5]:
df.head()

,Job Title,Salary,Location
0,Data Scientist,"5.5K - 11,000 monthly",Kuala Lumpur
2,System Support Engineer (Software Developer),"5K - 8,000 monthly",Kuala Lumpur
4,Web Developer (Python),"6K - 8,000 monthly",Kuala Lumpur
5,AI Scientist,"4.4K - 8,000 monthly",Kuala Lumpur
6,Senior Software Developer,"6K - 10,000 monthly",Kuala Lumpur

In [6]:
df.shape

(9262, 3)

In [7]:
list(df['Job Title'].unique())

['Data Scientist',
 'System Support Engineer (Software Developer)',
 'Web Developer (Python)',
 'AI Scientist',
 'Senior Software Developer',
 'System Programmer',
 'AIOps Engineer',
 'Software Engineer',
 'Senior Software Engineer, CCS5 (COBOL)',
 'Back-end Developer (Artificial Intelligence Project)',
 'SQL Programmer',
 'Software Engineer (Development)',
 'Python Developer',
 'Embedded Linux Software Engineer',
 'Backend Developer',
 'Data Scientist (Fintech)',
 'Analyst Programmer',
 'SOFTWARE ENGINEERS',
 'Software Engineer (CRM/ Trading Platform)']

In [8]:
df['Location'].unique()

array(['Kuala Lumpur', 'Petaling Jaya', 'Shah Alam/Subang', 'Selangor',
       'Melaka', 'Penang'], dtype=object)

In [9]:
df_eng = pd.read_csv('jobs_DE.csv')

df_eng.head()

,Job Title,Salary,Location
0,Azure Data Engineer,NaN,Kuala Lumpur
1,Data Scientist,"5.5K - 11,000 monthly",Kuala Lumpur
2,Data Visualization Engineer / Developer,NaN,Selangor
3,Data Center Engineer,"3.5K - 5,500 monthly",Kuala Lumpur
4,Data Engineer,NaN,Klang/Port Klang

In [10]:
df_eng.isnull().sum()

Job Title        0
Salary       16055
Location         0
dtype: int64

In [11]:
df_eng.shape

(22037, 3)

In [12]:
df_eng.dropna(inplace=True)

In [13]:
df_eng.shape

(5982, 3)

In [14]:
df.shape

(9262, 3)

In [15]:
df_concat = pd.concat([df,df_eng], join='inner')
df_concat.head()

,Job Title,Salary,Location
0,Data Scientist,"5.5K - 11,000 monthly",Kuala Lumpur
2,System Support Engineer (Software Developer),"5K - 8,000 monthly",Kuala Lumpur
4,Web Developer (Python),"6K - 8,000 monthly",Kuala Lumpur
5,AI Scientist,"4.4K - 8,000 monthly",Kuala Lumpur
6,Senior Software Developer,"6K - 10,000 monthly",Kuala Lumpur

In [16]:
df_concat.shape

(15244, 3)

In [17]:
df_concat.isnull().sum(
)

Job Title    0
Salary       0
Location     0
dtype: int64

In [18]:
list(df_concat['Salary'].unique())

['5.5K - 11,000 monthly',
 '5K - 8,000 monthly',
 '6K - 8,000 monthly',
 '4.4K - 8,000 monthly',
 '6K - 10,000 monthly',
 '5K - 7,000 monthly',
 '4K - 5,600 monthly',
 '3K - 4,500 monthly',
 '7K - 10,000 monthly',
 '6.5K - 10,000 monthly',
 '3.8K - 6,500 monthly',
 '3.5K - 7,000 monthly',
 '6.5K - 9,100 monthly',
 '7K - 14,000 monthly',
 '4K - 6,000 monthly',
 '10K - 12,000 monthly',
 '3.5K - 6,500 monthly',
 '3.5K - 5,500 monthly',
 '5K - 10,000 monthly',
 '10K - 14,000 monthly',
 '8K - 10,900 monthly']

In [19]:
# Split the 'Values' column and create a new column with the separated values
df_concat[['Number', 'After_K']] = df_concat['Salary'].str.split('K', expand=True)
df_concat.head()

,Job Title,Salary,Location,Number,After_K
0,Data Scientist,"5.5K - 11,000 monthly",Kuala Lumpur,5.5,"- 11,000 monthly"
2,System Support Engineer (Software Developer),"5K - 8,000 monthly",Kuala Lumpur,5,"- 8,000 monthly"
4,Web Developer (Python),"6K - 8,000 monthly",Kuala Lumpur,6,"- 8,000 monthly"
5,AI Scientist,"4.4K - 8,000 monthly",Kuala Lumpur,4.4,"- 8,000 monthly"
6,Senior Software Developer,"6K - 10,000 monthly",Kuala Lumpur,6,"- 10,000 monthly"

In [20]:
df_concat.shape

(15244, 5)

In [24]:
df_concat.dtypes

Job Title    object
Salary       object
Location     object
Number       object
After_K      object
dtype: object

In [28]:
df_concat['Number'] = df_concat['Number'].astype(float)

In [29]:
df_concat.dtypes

Job Title     object
Salary        object
Location      object
Number       float64
After_K       object
dtype: object

In [30]:
df_concat['Number'] = df_concat['Number']*1000

In [31]:
df_concat.head()

,Job Title,Salary,Location,Number,After_K
0,Data Scientist,"5.5K - 11,000 monthly",Kuala Lumpur,5500.0,"- 11,000 monthly"
2,System Support Engineer (Software Developer),"5K - 8,000 monthly",Kuala Lumpur,5000.0,"- 8,000 monthly"
4,Web Developer (Python),"6K - 8,000 monthly",Kuala Lumpur,6000.0,"- 8,000 monthly"
5,AI Scientist,"4.4K - 8,000 monthly",Kuala Lumpur,4400.0,"- 8,000 monthly"
6,Senior Software Developer,"6K - 10,000 monthly",Kuala Lumpur,6000.0,"- 10,000 monthly"

In [32]:
df_concat.drop(['Salary'], axis=1, inplace=True)

df_concat.head()

,Job Title,Location,Number,After_K
0,Data Scientist,Kuala Lumpur,5500.0,"- 11,000 monthly"
2,System Support Engineer (Software Developer),Kuala Lumpur,5000.0,"- 8,000 monthly"
4,Web Developer (Python),Kuala Lumpur,6000.0,"- 8,000 monthly"
5,AI Scientist,Kuala Lumpur,4400.0,"- 8,000 monthly"
6,Senior Software Developer,Kuala Lumpur,6000.0,"- 10,000 monthly"

In [33]:
df_concat.shape

(15244, 4)